{
    "Who is QuickEnrollment Inc?":"QuickEnrollment was established in September 1999 and operates out of Toronto, Ontario, Canada. QuickEnrollment Inc. provides online registration solutions particularly, but not exclusively, to amateur and recreational sports organizations, their respective leagues and the tournaments they run. Our expertise and knowledge in this area has allowed us to become registration specialists, thereby providing our clients with the best online registration solution in the industry.<br><br>QuickEnrollment has essentially automated the traditional paper-based registration process that currently exists in amateur and recreational sports by leveraging state-of-the-art Internet based tools and technologies in creating the QE Online Registration Management System. We provide online registration solutions to address the registration needs in three key areas of amateur sport: League Registration, Tournament Registration and Event Registration (e.g. Clinics, Recertification Courses)",
    "How much does this service cost?":"The association you are registering for needs to become a client of QuickEnrollment for this service to be offered to the general membership. Price varies for many reasons; primarily depending on what system you are interested in using. Our pricing model is transaction-based and we DO NOT CHARGE ANY UPFRONT COSTS to the association. To find out more click here or contact QuickEnrollment at info@quickenrollment.com<br><br>If you are a participant and like the added convenience the QuickEnrollment System provides and your association is not offering this service to the membership, send us an email and we will get in touch with them immediately.<br><br>If you are an executive member of an association and you are interested in how QuickEnrollment can help you save time and money, click here to find out more.",
    "What is the relationship between QuickEnrollment and the association I am a member of?":"It is important to understand that QuickEnrollment PROVIDES online registration services to your organization. We DO NOT manage the registration of your association, so, we cannot provide you with answers relating specifically to acceptance or rules surrounding registration. We simply PROVIDE online registration services. However, feel free to contact us if you are having technical difficulties with the system.",
    "I want to register my child for…(hockey, soccer, baseball, etc.), how do I do this?":"First, your organization needs to be a client of QuickEnrollment in order to have their registration form on the QuickEnrollment System and provide this convenient service to you. If this is not the case, then click here and send us an email of the association you belong to and we'll do our best to get in touch with someone at the association.<br><br>If your association IS a client of QuickEnrollment and you've been instructed that QuickEnrollment is providing online registration services for your convenience, you should go to your associations website and find out more about how to register online. In most cases, your association will provide a link to the registration system.<br><br>If your association does not have a website, you need to contact the president or registrar of your association and get the QuickWord that you need in order to enter the registration system and register your child. QuickEnrollment is not responsible for giving out passwords to participants. The QuickWord™ is initially assigned to the administrator, by QuickEnrollment, and is to be then given by the administrator to the participant."
}